html/erlang.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Erlang</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">Erlang</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 错误处理哲学</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 错误处理哲学</h2>
<div class="outline-text-2" id="text-1">
<p>
如果你来自c这样的语言，这听起来会非常奇怪。在c里我们被教导要编写预防性代码，程序应当检查它们的参数以避免崩溃。在c里这么做很有必要：编写多进程代码极其困难，而且绝大多数应用程序只有一个进程，所以如果这个进程让整个应用程序崩溃，麻烦可就大了。这意味着需要大量的错误检查代码，他们会和非错误检查代码交织在一起。
</p>

<p>
在erlang，我们所做的恰恰相反。我们会把应用程序构建成两个部分：一部分负责解决问题，另外一部分负责在错误时纠正他们。负责解决问题的部分会尽可能的少用防御性代码，并假设函数的所有参数都是正确的，程序也会正常运行。纠正错误的部分往往是通用的，因此同一段错误纠正代码可以用在许多不同的应用程序里。举一个例子，如果数据库的某个事物出了错，就应当简单地中止该事务，让系统把数据库恢复到出错之前的状态。如果操作系统里某个进程崩溃了，就让操作系统关闭所有打开的文件或套接字，然后让系统恢复到某个稳定状态。
</p>

<p>
这么做让任务有了清楚的区分，编写解决问题的代码和错误修复的代码，让两者不会交织在一起，代码的体积可能会因此显著变小。
</p>

<p>
让程序在出错时立即崩溃，通常是一个很好的主意，事实上他有不少优点：
</p>
<ol class="org-ol">
<li>不必编写防御性代码来防止错误，直接崩溃就好。
</li>
<li>不必思考应对措施，而是选择直接崩溃，别人会来修复这个错误。
</li>
<li>不会使错误恶化，因为无需在知道出错后进行额外的计算。
</li>
<li>如果在错误发生后，第一时间举旗示意，就能得到非常好的错误诊断，在错误发生后继续运行，经常会导致更多错误发生，让调试变得更加困难。
</li>
<li>并且错误恢复代码时，不用担心崩溃的原因，只需要把注意力放在事后清理上。
</li>
<li>它简化了系统架构，这样我们就能把应用程序和错误恢复当成两个独立的问题来思考，而不是一个交叉的问题。
</li>
</ol>

<p>
<b>找其他人修复：</b>
</p>

<p>
别人来修复某个错误，而不是自己动手，是个不错的主意，它能够促进专业化。如果我需要做手术，就会去找大夫，而不是尝试自己操作。如果我的汽车出了点小问题，车上的控制电脑会尝试修复它，如果修复失败，问题会变得更加棘手，就必须把车拉到修理厂，让其他的人来修理。如果erlang进程出了点小问题，可以尝试用try/catch来修复它，但如果修复失败，就应该直接崩溃，让其他进程来修复这个错误。
</p>
</div>
</div>
</div>
</body>
</html>
